{"meta":{"title":"Music Diary","subtitle":"A Rookies's road","description":null,"author":"Wenzhong","url":"http://musicdiary.me"},"pages":[],"posts":[{"title":"和弦分析--李荣浩《老伴》","slug":"和弦分析-李荣浩《老伴》","date":"2018-12-30T04:13:18.000Z","updated":"2018-12-31T08:31:59.645Z","comments":true,"path":"2018/12/30/和弦分析-李荣浩《老伴》/","link":"","permalink":"http://musicdiary.me/2018/12/30/和弦分析-李荣浩《老伴》/","excerpt":"","text":"不知道有没有扒过创作人谱子的朋友，会发现某些歌曲，虽然找到了调，但扒出来的和弦总是别扭或者还原度不足。这个时候我们可能要考虑一下一个你可能忽略的维度，「调式」。 pop / ballad 曲风，大多会使用自然大调 或者自然小调 来作曲，也就是从根音开始，每个调内音之间的差别分别是「全全半全全全半」或「全半全全半全全」，如 C大调的 Do Re Mi Fa So La Ti Do和 A 小调的 「La Ti Do Re Mi Fa So La」。 假如按照这种调式来进行扒谱的话，我们会发现老伴这首曲子的前奏和弦走向是 Bb (Bb C D Eb F G A)，但是扒完主歌以后我们就会发现一个很奇怪的事情，一级/四级/五级 都用得很少很少，反而是二级和六级用得很多。这不像是一个典型的作曲模式。 这类矛盾出现的时候，就要看看有没有哪些前提是错的，这里我觉得采用自然调式的前提可能是错的。 由于首和弦是 Cm，我们就尝试定调为 C，那么音阶的排列就是 C D Eb F G A Bb C，这种「全半全全全半全」正好是我们的 多利亚音阶 Dorian Mode，假如用 Dorian 的 C 调来进行扒谱，就能得到相对干净的谱面。注意，在主歌和副歌之间，有一个调式切换，主歌是 C Dorian 调，副歌是 C 大调。来体会一下： 1234567891011121314151617181920212223242526Cm Gm7/Bb F/A G7 F Adim G7 誰陪我做執迷的鯨魚 在人海中游來游去 說自己的言語Cm Gm7/Bb F/A G7 F Adim G7 誰陪我建永恆的故居 在歲月中跑來跑去太容易疲倦 一轉身可以歸去Fm7 Gm7 C（转大调）我要找的一種感覺叫屬於 F G Am C F E Am C 有沒有 春花秋月 夏蟬冬雪 不會散去 有沒有 一關上門 一躺下來 不再離去 F E Am D7 Dm7 Gm7 Cm7（转 Dorian）有沒有 愛看的天 愛踏的地 我愛著的你 陪我美麗的 老去間奏：│ Cm Gm7/Bb F/A G7 ２ＸCm Gm7/Bb F/A G7 F Adim G7 是否按著時代的規律 在奔波中甚麼不是一霎那的玩具Cm Gm7/Bb F/A G7 F Adim G7 是否還有永恆的老曲 在歲月中就算最後只能夠沉默 一輩子沒有恐懼Fm7 Gm7 C（转大调）我要找的一種感覺叫屬於 F G Am C F E Am C 有沒有 春花秋月 夏蟬冬雪 不會散去 有沒有 一關上門 一躺下來 不再離去 F E Am D7 Dm7 Gm7 Cm7（转 Dorian）有沒有 愛看的天 愛踏的地 我愛著的你 陪我美麗的 老去 然后来分析一下Bridge 1234(Cm) Gm G#maj7 Gm誰 叫我很青春 誰 叫我笑Fm7 A Fm7 Gm7 C# 只有你 能叫我 不怕老去 Bridge 完了以后就升调到 C# 大调（哎呀五个黑键啊）1234 F# G# A#m C# 有一天 春花秋月 夏蟬冬雪 不會散去有一天 一關上門 一躺下來 不再離去 有一天 愛看的天 愛踏的地 我愛著的你F#m7 G#m7 陪我美麗的 老去 尾奏重新转回 C# Dorian1C#m B A B C#maj7 Reference 老伴 – 李荣浩 Chord4 version","categories":[],"tags":[]},{"title":"A memo of Barre Chords","slug":"A-memo-of-Barre-Chords","date":"2017-12-03T13:54:16.000Z","updated":"2018-09-02T07:35:40.000Z","comments":true,"path":"2017/12/03/A-memo-of-Barre-Chords/","link":"","permalink":"http://musicdiary.me/2017/12/03/A-memo-of-Barre-Chords/","excerpt":"Well I want to make a summary of all kinds of Barrie Chords for future reference, although I should remember them as long as I wrote this article. 7 chordsrooted at E String1234567m7 Maj7 7 m7b5 7#5 ----- ----- ----- ----- ----- --8-- 5 --8-- 5 --8-- 5 --7-- b5 --9-- #5 --8-- b3 --9-- 3 --9-- 3 --8-- b3 --9-- 3 --8-- b7 --9-- 7 --8-- b7 --8-- b7 --8-- b7 ----- ----- ----- ----- ----- --8-- R --8-- R --8-- R --8-- R --8-- R rooted at A String1234567m7 Maj7 7 m7b5 7b9 --3-- 5 --3-- 5 ----- ----- ----- --4-- b3 --5-- 3 --1-- R --4-- b3 --2-- b9 --3-- b7 --4-- 7 --3-- b7 --3-- b7 --3-- b7 ----- --5-- 5 --2-- 3 --4-- b5 --2-- 3 --3-- R --3-- R --3-- R --3-- R --3-- R ----- ----- ----- ----- ----- try Bm7 -&gt; E7 -&gt; Amaj7","text":"Well I want to make a summary of all kinds of Barrie Chords for future reference, although I should remember them as long as I wrote this article. 7 chordsrooted at E String1234567m7 Maj7 7 m7b5 7#5 ----- ----- ----- ----- ----- --8-- 5 --8-- 5 --8-- 5 --7-- b5 --9-- #5 --8-- b3 --9-- 3 --9-- 3 --8-- b3 --9-- 3 --8-- b7 --9-- 7 --8-- b7 --8-- b7 --8-- b7 ----- ----- ----- ----- ----- --8-- R --8-- R --8-- R --8-- R --8-- R rooted at A String1234567m7 Maj7 7 m7b5 7b9 --3-- 5 --3-- 5 ----- ----- ----- --4-- b3 --5-- 3 --1-- R --4-- b3 --2-- b9 --3-- b7 --4-- 7 --3-- b7 --3-- b7 --3-- b7 ----- --5-- 5 --2-- 3 --4-- b5 --2-- 3 --3-- R --3-- R --3-- R --3-- R --3-- R ----- ----- ----- ----- ----- try Bm7 -&gt; E7 -&gt; Amaj7 9 chordsrooted at E String1234567m9 9 Maj9--10- 9 -10-- 9 -------8-- 5 --8-- 5 --8-- 5--8-- b3 --9-- 3 --7-- 9--8-- b7 --8-- b7 --9-- 7----- -10-- 5 --7-- 3--8-- R --8-- R --8-- R rooted at A String1234567m9 9 Maj9----- ----- ----- --3-- 9 --3-- 9 --3-- 9 --3-- b7 --3-- b7 --4-- 7 --1-- b3 --2-- 3 --2-- 3 --3-- R --3-- R --3-- R ----- ----- ----- try Bm9 -&gt; E9 -&gt; Amaj0 11 chordsMaj11 is not used much because there are tritone.123456711 m11 --3-- 5 ----- --3-- 9 --6-- 11 --3-- b7 --8-- b3 --3-- 11 --8-- b7 --3-- R ----- ----- --8-- R 13 chords(usually don’t play 11)13 = 9 sus 5 to 6 . And m13 is not used much because there are tritone.123456713 Maj13--5-- 6 -10-- 9--3-- 9 -10-- 13--3-- b7 --9-- 3--2-- 3 --9-- 7--3-- R ----- ----- --8-- R Bm9 -&gt; E13 -&gt; Amaj13 (ii-V-I) DiminishAs 7, Half diminish 7 settle to Root Triad(Bm7b5 -&gt; C) As 3Cmaj7 -&gt; Dm7 -&gt; Em7b5 -&gt; A7 -&gt; Dm7 -&gt; G7 -&gt; Cmaj7 Dm7 -&gt; G7 -&gt; Em7b5 -&gt; Aaug7 -&gt; Dm7 -&gt; G7 -&gt; Cmaj7 As 2C -&gt; Dm7b5 -&gt; G7 -&gt; C As MajorAm -&gt; Bm7b5 -&gt; E7 -&gt; Am As Minor Diminish 7 settle to Root minor (Bdim7 -&gt; Cm)","categories":[{"name":"Music","slug":"Music","permalink":"http://musicdiary.me/categories/Music/"},{"name":"Music Theory","slug":"Music/Music-Theory","permalink":"http://musicdiary.me/categories/Music/Music-Theory/"}],"tags":[{"name":"Music","slug":"Music","permalink":"http://musicdiary.me/tags/Music/"}]},{"title":"Drum Practicing Reflection","slug":"Drum-Practicing-Reflection","date":"2017-08-13T07:35:20.000Z","updated":"2018-09-02T07:35:40.000Z","comments":true,"path":"2017/08/13/Drum-Practicing-Reflection/","link":"","permalink":"http://musicdiary.me/2017/08/13/Drum-Practicing-Reflection/","excerpt":"I Collect a lot of questions and visit a pro today, and here are what I have asked and feedbacks: Q: what’s the correct sitting position when playing? A: Balanced, neutral, and centered – no hunching over, no slouching, no jumping up out of your seat to reach a cymbal. If you are towering over the drums and pedals, you’re sitting too high. Move your seat into position behind your drum set, and rest your feet on your pedals. Both legs should have approximately the same angle at the knees and be spread evenly apart.","text":"I Collect a lot of questions and visit a pro today, and here are what I have asked and feedbacks: Q: what’s the correct sitting position when playing? A: Balanced, neutral, and centered – no hunching over, no slouching, no jumping up out of your seat to reach a cymbal. If you are towering over the drums and pedals, you’re sitting too high. Move your seat into position behind your drum set, and rest your feet on your pedals. Both legs should have approximately the same angle at the knees and be spread evenly apart. Q: How should I hold and strike the drum stick? Is vertical rebound a must when practicing? I always feel unstable with this guesture. A: No. The strength of wrist is something fundermental but you skip that training and use your finger to control the stick too early. It’s highly suggest that practice your wrist to improve strength and flexibility at first. Q: How should I practice the coordination and independence of my hand foot? Should I always practice them at the same time or do it separately at first and then later combine them together? A: The latter one. Your weak side hand / foot is noticeable and do it at the same time would be difficult and it will enhance a incorrect muscle memory and take you more time for future correction. Wenzhong: However I also found some independence training video on Youtube such as this one and How to separate your hi-hat and kick drum. And I am very convinced that before practising, the most important thing is “Knowing what it is that you are trying to play”. Q: What’s the correct hand sequence for a doublet / triplet / roll ? A: Play it alternatively will be easy for beginner, but if you want to add some difficulty and build up solid basic skills, try every possible ways. Q: Why Accent Shift （重音移位） is important and how it could be applied in a song? A: It’s quite important and it make your groove filled with rhythm. Q: Given a pattern / groove, what BPM are sufficient for beginner training? A: 100 is fine. start with 60 or slower, and then add 5 when you feel your work is solid. Q: Heel up or Hell down? A: Heel up. Heel down has a lot of limitation, the most critical one is speed. And you will also feel tired very soon. Q: Why I feel Hi-Hat sound is not satisfying? I am using Roland’s TD-11K. A: Roland’s kit are nice, there might be something wrong with your hi hat pedal. Q: Any suggestion of playing Ghost Note? A: Hmm… You are not quite close to this stage, practice your basic skills first man. Q: Game like Drum Mania bring positive or negative impact to training? A: A well organized and moderate difficulty tab will help you, but remember, basic training is fundermental. Q: How should I enhance my left hand? A: Practice more on your weak hand. For example, a ‘R-L-R-L’ pattern could be transferred to ‘R-L-L-L’ or ‘L-L-L-R’, you could also invert your left and right to practice all the groove you have practiced to improve your weak limbs. Q: How to erase or get rid of incorrect muscle memory? A: Well it’s difficult, all you could do is using those correct gesture to replace them slowly. Q: If I am trying to practice several groove, should I practice the first one from 60 to 100, then second one from 60 to 100, or practice all with 60, and then gradually increase to 100?A： The latter one is fine and more interesting, right? Q: Where I could find groove of other gene like funk / Jazz / Bossa ? A: Well let me give you a tutorial book, with some Funk tab in it.","categories":[{"name":"Music","slug":"Music","permalink":"http://musicdiary.me/categories/Music/"},{"name":"Drums","slug":"Music/Drums","permalink":"http://musicdiary.me/categories/Music/Drums/"}],"tags":[{"name":"Drums","slug":"Drums","permalink":"http://musicdiary.me/tags/Drums/"}]},{"title":"Nice Chord Study Notes (1-50)","slug":"Nice-Chord-Study-Notes-1-50","date":"2017-04-18T13:13:40.000Z","updated":"2018-09-02T07:35:40.000Z","comments":true,"path":"2017/04/18/Nice-Chord-Study-Notes-1-50/","link":"","permalink":"http://musicdiary.me/2017/04/18/Nice-Chord-Study-Notes-1-50/","excerpt":"Ep 13. Walking BassGiven a chord, how could we make it less dumb when playing bass line? use arpeggio change sequence of the arpeggio (keep the first note rooted) add some transition note (for example in a C-chord, add D between C and E) add some half note before root note at the first beat (for exmaple in a C F G C progression, add a Gb before F, add a F# before G add eighth-note or triplet into the rhythm Let’s see a combination of the above skills:","text":"Ep 13. Walking BassGiven a chord, how could we make it less dumb when playing bass line? use arpeggio change sequence of the arpeggio (keep the first note rooted) add some transition note (for example in a C-chord, add D between C and E) add some half note before root note at the first beat (for exmaple in a C F G C progression, add a Gb before F, add a F# before G add eighth-note or triplet into the rhythm Let’s see a combination of the above skills: Ep 17. How to write a pumping bassline?There are some tricks we could used when designing a bass line. root note on first beat root note on each beat add some variation on rhythm add octave add quint add seventh add other notes which seems well :) Ep 18. Dominant-11-chordWhat’s F/G(named F Over G or F on G)? It’s a root note G and another F chord above it. But it seems ridiculous to noob like me – why it’s reasonable? The answer is: F/G is actually the G11 chord omitting 3 and 5. NOTE: G11 = G B D F A C Take a look at another chord Dm7/G. It’s also a G11 chord omitting 3. And here comes the question: why we tend to omit 3 in G11? Wiwi gives us an explanation that: B(3) and C(11) seems not that match so we are trying to omit 3 Another question: What’s relation between Dm7/G and G9sus4? The answer is they are the same. Dm7/G = G11(omit3) G9sus4 = G9 sustitude 3 with 4 Ep.19 Dominant-13Most commonly used Dominant 13 are: 1-3-7-13 1-3-7-9-13 1-7-9-11-13 Why omit 5? Same reason as Ep.18 mentioned? 5 and 13 are relatively close？ But the note between 3 and 4 are half-tone. Note between 5 and 6 are a whole note. No idea. Any hint? Ep.22 3 types of minor modeThere are 3 types of minor scale: Natural minor scale (1-2-3b-4-5-6b-7b) Harmonic minor scale (1-2-3b-4-5-6b-7) Melodic minor scale (1-2-3b-4-5-6-7) for upwards (1-7b-6b-5-4-3-2-1) for downwards The original Harmonic Minor Scale is invented to resolve the problem that m7 are not able to settled the following Root note comfortably in Natural Minor Scale. For example, in G7 there is a B note which is close to C so a sense of settled are encouraged, but in Gm7, a Bb is introduced and it’s further away from C, which leads to an unwillingness to settled. The classic musician comes up with an idea that if I could switch back the 7th note from flat to origin, then everything solved. That’s the origin of Harmonic Minor Scale: (1-2-3b-4-5-6b-7). And yes, now Gm7(in Harmonic minor scale) become more intended to settle with C, but it brings another (bigger) problem. Now the gap between 6b and 7 is too wide and it sounds more like indian scale! Since it’s not allowed in classical music, musicians then comes up another idea to reset the 6th note so it could connect to 7th nicely. However, if direction reserved, then we don’t have to settle 7b to 1, so 7b could stay as it is, and therefore 6b could remain the same without impacting anything. This is what we call the Melodic Minor Scale, a scale to solve the “6b -&gt; 7” problem. (1-2-3b-4-5-6-7-1-7b-6b-5-4-3b-2-1) Ep.24-26 I-D-P-L-M-A-L Scales Ionian / Dorain / Aeolian Phrygian / Lydian AeolianScale of Aeolian: 1-2-b3-4-5-b6-b7. To make it sound like Aeolian, we should introduce more b3/b6/b7 in melody. A typical chord of Aeolian is mb6. Amb6 is the hook of X files theme. DorianScale of Dorian: 1-2-b3-4-5-6-b7 Differences between Dorian &amp; Aeolian is the 6th note. a standard 6 make Dorian more ancient and less sad. See Pars-ley, sage, rose-ma-(ry) and thyme in Scarborough Fair PhrygianScale of Phrygian: 1-b2-b3-4-5-b6-b7 Only half-note between 1 and 2 is a brand of Phrygian (Locrian should be the same, but it’s the only diff between Phrygian and Aeolian). But according to Wiwi, the variation of Phrygian – Phrygian Dominant (1-b2-3-4-5-b6-b7) is more likely to be used in Flamenco Guitar. A very interesting things for Phrygian Dominant scale is that both I &amp; II chord are major scales (1-3-5, b2-4-b6) LydianScale of Lydian: 1-2-3-#4-5-6-7 brand note is 4th. And if we pile the notes in scale every other note, then we could get 1-3-5-7-9-#11-13, which is a Major13#11 chord and it feels dreamy… The most famous example of Lydian is Microsoft Windows 98 Opening chord. Some other tricks of Lydian is: both I &amp; II chord are major scales (1-3-5, 2-#4-6), switching from I to II to make a heroic mood combine #4 and 5 to create sense of ridiculous MixolydianScale of Mixolydian: 1-2-3-4-5-6-b7 It’s mostly used in Blues and Jazz since it fits with 7 chord. LocrianScale of Locrian: 1-b2-b3-4-b5-b6-b7 The only scale that have a flat-5, and the I chord is dim, make the mood of this chord dark. So 5th note is the branding note. Ep.27 whole tone scaleScale of whole tone scale: 1-2-3-#4-#5-#6 Ep.28 Secondary DominantWhat’s secondary dominant chord? In chord transition, if we add 5 degree to the target chord and use dominant 7 chord between the transition, it’s still harmonic. The added chord is Secondary Dominant chord. Examples: C -&gt; Em =&gt; C -&gt; (B7) -&gt; Em Here are some other example, and a combination of these tricks. C -&gt; Am =&gt; C -&gt; (E7) -&gt; Am C -&gt; G =&gt; C -&gt; (D7) -&gt; G C -&gt; Dm =&gt; C -&gt; (A7) -&gt; Dm Ep.29 Triple ToneThe reason why a V7 chord is likely to settle to I is that V7 contains two tones (7 &amp; 4) which are 3 whole tones away. Such 3 whole tones combination give us an intention to be settled by the next chord. So if we could find another 3 whole tones, then it could be also the transition chord instead of the V7 chord. Examples: * `G7 -&gt; C` =&gt; `Db7 -&gt; C` * `E7 -&gt; Am` =&gt; `Bb7 -&gt; Am` if we compare Db and C / Bb and A, Db is half tone higher than C, so as Bb and C. So it give us another hint that, we could use the 7 chord of a half tone higher note to transit. See this example below: Ep.30 More Secondary DominantTo extend secondary dominant chord, we can add II or IV before it. Examples: * `C -&gt; Fmaj7` =&gt; `C -&gt; C7 -&gt; Fmaj7` =&gt; `C -&gt; Gm7 -&gt; C7 -&gt; Fmaj7` (add II chord (Gm)) * `C2 -&gt; G2` =&gt; `C2 -&gt; D7 -&gt; G2` =&gt; `C2 -&gt; Am7 -&gt; D7 -&gt; G2` When transition target chord is minor one, the II chord we add should be Half seventh chord Examples: * `C -&gt; Am` =&gt; `C -&gt; E7 -&gt; Am` =&gt; `C -&gt; Bm7b5 -&gt; E7 -&gt; Am` Ep. 32-34 Dorian Improvisation / Double Dorian Improvisation / Blue Scale ImprovisationThese 3 episodes provide a very helpful way to practise improv skills (and seems it works even for noobie like me). Here are the steps: Pick a root note and a scale. For example, C Dorian. Determine left hand appregio by choosing 4 to 5 notes in scale. As mentioned, VI in Dorain is prominant, so we pick 1-b3-5-b6. Give it a fix pattern, and repeat during the whole improvisation. Develop right hand melody. It’s difficult to develop, but we could follow these 3 steps: play in scale (upwards and downwards). play in scale with eight-note rhythm (upwards and downwards). play in scale with eight-note rhythm (random direction). play in scale with eight-note rhythm (random). play in scale with eight-note rhythm (random + repeat note). play in scale with eight-note rhythm (random + repeat note + dual tone + triple tune). play in scale with eight-note （and sixteenth-note or triplet) rhythm (random + repeat note + dual tone + triple tune). play a famous song in scale. Ep.41 Major 11The reason why we usually use #11 instead of 11 in Major scale is that VII note and XI note are triple whole tones, which make it less stable. Ep.42 Alternations in Dominant ChordsTo make chords a little bit diff from the original chord, we could switch 5 and 9 to b5 also #11|#5 also b13|b9|#9 in dominant chords. So, for a C9 chord, 3*3 of variation could be applied. C9 C9b5 C9#5 C7b9 C7#9 C7b5b9 C7b5#9 C7#5b9 C7#5#9 As a relevant topic, Ep.48 Altered Scale are constructed by a Mixolydian scale which replace 5 with two notes b5 and #5, replace 9 with b9 and #9 Ep.42 Minor 11 and Ep.43 for moreFor complicate chords, arrangement is important. Here are arrangements introduced in Ep.42: (low)C - bE - G - bB - (high)D - (high)F (low)C - bE - F - G - bB - (high)D the root note are separated from the other notes. the high part make entanglement mood. Ep.43 introduce some other arrangement. Notes arrangement are much more averaged. Here are the first one, notes are spread for boarder range:low(C) - low(G) - D - bE - bB - (high)FHere C-G-D &amp; bE-bB-F share same interval patterns(5 degrees). This is awesome! Try this score Another arrangement is omitting 5 and 9 note, make it a Cm7(add11) -&gt; C &amp; bE-bB-F Ep.44 Borrowed chord Borrowed chords: A borrowed chord (also called mode mixture and modal interchange) is a chord borrowed from the parallel key (minor or major scale with the same tonic). Borrowed chords are typically used as “color chords”, providing variety through contrasting scale forms, major and the three forms of minor. Using C Major/Minor as an example: Major C Dm Em F G Am Bdim Minor Cm Ddim E Fm Gm Ab Bb For example, a C major progression C-Am-F-G, all non-rooted chord could be switched to it’s minor version. So here are possible variation of C(add2) - Am11 - FMaj9 - G11: C(add2) - AbMaj9 - FMaj9 - G11 C(add2) - AbMaj9 - Fm9 - G11 C(add2) - AbMaj9 - Fm9 - Gm7 Ep.47 Motivic DevelopmentWhen you are trying to write a melody but there is no idea for what you are going to write. Here are the way: think of a [Motif] (https://en.wikipedia.org/wiki/Motif_(music)) : a short musical idea. try move upwards/downwards the motif, or reverse the note movement direction. change a little bit of tempo","categories":[{"name":"Music","slug":"Music","permalink":"http://musicdiary.me/categories/Music/"},{"name":"Music Theory","slug":"Music/Music-Theory","permalink":"http://musicdiary.me/categories/Music/Music-Theory/"}],"tags":[{"name":"Chords","slug":"Chords","permalink":"http://musicdiary.me/tags/Chords/"}]},{"title":"2015-11-14 知乎盐沙龙活动随笔","slug":"Zhihu-Salon-Memo","date":"2015-11-14T07:08:35.000Z","updated":"2018-09-02T07:35:40.000Z","comments":true,"path":"2015/11/14/Zhihu-Salon-Memo/","link":"","permalink":"http://musicdiary.me/2015/11/14/Zhihu-Salon-Memo/","excerpt":"今天去参加了一下知乎和网易云音乐举办的盐沙龙——《旋律方法论》。主题本是讨论和作词作曲相关的话题，最后扯着扯着，就变成了大咖在探讨行业发展和进行爆料，也是醉了。不过还是有干货的，特别是小鱼老师啊……简单地记录一下各个老师讲的我觉着有用的东西吧。","text":"今天去参加了一下知乎和网易云音乐举办的盐沙龙——《旋律方法论》。主题本是讨论和作词作曲相关的话题，最后扯着扯着，就变成了大咖在探讨行业发展和进行爆料，也是醉了。不过还是有干货的，特别是小鱼老师啊……简单地记录一下各个老师讲的我觉着有用的东西吧。 邓柯老师 – 流行歌曲的主副歌结构 主题实在有点水…… 给了一个歌单，歌曲都是非主副歌结构的歌单。可以感受一下。 My Way – Frank Sinatra Unchain My Heart – Ray Charles R.E.S.P.E.C.T – Aretha Franklin Teas in Heaven – Eric Clapton Why Nobody Fights – 华晨宇 小咸鱼AirS – 如何创作？ 音高 运用音程关系的变化起表达情绪。 但也有特例，例如李荣浩的《李白》的副歌部分。基本上都是一个音。 音阶的选择。写中国风，就多用五声音阶，需要变化，可以加点变宫。 音域的设计。在主歌的时候对音高做一些保留，不要用尽主唱的音域。 节奏 律动单位的选择：在创作之前，设计好律动单位。 切分音设计：使用切分音能使音乐更灵动，不至于死板。 轻重音的设计：通过轻重强调乐段。加重的方法很多，例如加入人声和音或者使用额外乐器。 旋律展开手法 模进的使用（第一句是动机(motif)，第二句是第一句的模进，即进行音高平移，例如天空之城） 对仗（一句动机、二句模进，三句动机、四句模进） 和声跟随/动机跟随( ) 细节优化 装饰音和经过音（在两个音之间，加入音高在两个音之间的音） 句法起伏 人声特色的滑音细节（继续拿《李白》副歌当例子） 小鱼老师一直说模进会被不少人不齿，但却是目前流行音乐的关键，例如汪苏泷许嵩徐良，都在大量使用…… 赵佳霖 – 神曲是如何诞生的 怎么写神曲？ 都是全民歌曲。（不会只写给一个团体） 可以通俗，不要恶俗。 实现记忆点。 运气。 关于记忆点这个大咖们有好多话要说： 欧礼老师说为什么你能很快记得一首影视剧中的主题曲，那是因为在剧中，会把主题曲的Hook句用各种乐器包括唢呐二胡琵琶三弦古筝翻来覆去底埋在各个场景的背景音乐里面给你不断的重放和曝光。 佳霖老师说：一是歌词要简单（你是我的小苹果，谁记不住）；二是要旋律好记，有些情况旋律在已有的曲子里面隐藏住了（例如小苹果就很接近陕北民歌）。不少人已经被这些歌轰炸了二三十年 邓柯老师说：神曲的出现在于它满足了细分市场（群众的活动）的需要。以前就没人给大妈们写歌，但是她们就是要跳舞啊，那怎么办？ 其他杂七杂八的观点 创作先写Hook句，根据Hook句发展乐段。 歌曲最重要的还是旋律和歌词本身。 创作的时候需要人格分裂。代入主人公去创作，再适时跳出来作为听众感受一下。 音乐可以分成功能性和欣赏性音乐。有些满足商家的需要，有些满足百姓的需要，有些满足你自己的需要，对不同的音乐，应该用恰当的姿势，分开欣赏。 音乐和语言本身的音调需要匹配。（这个和Coursera上说的还是很match的） 目前人们获取信息的渠道太广，无法达到十年前的单一渠道时的推广效果。 视觉冲击降低了音乐的冲击，目前的电影和美剧配乐都在尽量淡旋律化。以前是对主题做变奏，现在在每个场景用一个。 私下我也跑去找这些咖们问了不少问题 Q：Pre-chours：一般有转调，转调的度数是否有pattern和anti-pattern？ A：当然有，找五度圈里面接近的调更容易获得好的转调效果。 Q：假如想创作重唱，如何分配？假如是为一首已有的旋律创作第二声部？ A：当然有，找五度圈里面接近的调更容易获得好的转调效果。重唱和和声的创作比较类似，也可以参考前面的五度圈法。但是和声一般不会有太大的起伏。 Q：一般如何针对主题选韵脚？ A：先把主题写好，多写几个备选，然后你就会发现比较好写的韵脚会是哪个，到时候再针对这个韵脚发展。 Q：有没有韵脚字典之类的工具可以使用？ A：现在有可以根据情绪和韵脚提供候选词的工具啦。 最后感叹一下世界真小，一排五个人，其中两个人居然是二度好友：一个是同事的同学，一个是直系学妹。希望后面能有机会和你们再见哈。","categories":[{"name":"Music","slug":"Music","permalink":"http://musicdiary.me/categories/Music/"},{"name":"Music Production","slug":"Music/Music-Production","permalink":"http://musicdiary.me/categories/Music/Music-Production/"}],"tags":[{"name":"Music","slug":"Music","permalink":"http://musicdiary.me/tags/Music/"},{"name":"Zhihu","slug":"Zhihu","permalink":"http://musicdiary.me/tags/Zhihu/"}]},{"title":"爱因斯坦首演后台采访稿","slug":"Einstein-Interview","date":"2015-01-18T17:17:10.000Z","updated":"2018-09-02T07:35:40.000Z","comments":true,"path":"2015/01/19/Einstein-Interview/","link":"","permalink":"http://musicdiary.me/2015/01/19/Einstein-Interview/","excerpt":"爱因斯坦民乐团在苦苦等待鼓手考完试后猛烈地备战了五天，终于在昨天完成了首演。这场表演背后究竟都有着哪些故事和槽点呢？ Q：乐队为什么叫爱因斯坦？A：取这个名字一是办公室装修之前我们所有的排练都在11层的爱因斯坦会议室，二则是爱因斯坦本身就是致力改变世界又爱好音乐的人。我们从现实和精神层面来讲还是很有缘分的。 Q：起这个名字会不会感觉太狂了？A：有想过收敛一些，但后来大家纷纷表示爱因斯坦霸气。想想也是，做人不要太怂。 Q：乐队的少年少女们是怎么聚集到一起的？A：我和江頔大半年前开始一起玩。然后徐艺和高欣的入职信里面分别提到过自己有古筝和钢琴的背景，基本我都是第一时间发信过去邀请的。有一次排练路上遇到王维，王维给我展示了他手上的茧和摁弦留下的压痕把我惊着了，就顺理成章的拉他过来一起玩了。 Q：大家为了年会准备了多久？都怎么排练的？ A：大概一个半月前就知道有年会任务，但我刚好要出差，出差回来以后进入考试季，徐艺基本人间蒸发，高欣家里也有不少事情，所以排练基本停滞，新年了还没定歌，1月10号之前就没有一次排练能来超过三个人……好在徐艺考完试以后大家突然士气大涨团结了起来，很密锣紧鼓地排了好几个晚上。 按道理排练都是合练，大家把各自的部分练好，然后聚到一起合一下。可惜很多时候回家也没法练，只好占用合练的时间熟悉乐段。年会前的周日，江頔和王维突发奇想想来段Metallica的opening，他们俩就坐那里慢慢练。徐艺开始调古筝，王维抠了个简谱让她练西湖的前奏。我和Cynthia在抠21 guns bridge后面的一段钢琴的solo。临急抱佛脚，也胜于不抱。","text":"爱因斯坦民乐团在苦苦等待鼓手考完试后猛烈地备战了五天，终于在昨天完成了首演。这场表演背后究竟都有着哪些故事和槽点呢？ Q：乐队为什么叫爱因斯坦？A：取这个名字一是办公室装修之前我们所有的排练都在11层的爱因斯坦会议室，二则是爱因斯坦本身就是致力改变世界又爱好音乐的人。我们从现实和精神层面来讲还是很有缘分的。 Q：起这个名字会不会感觉太狂了？A：有想过收敛一些，但后来大家纷纷表示爱因斯坦霸气。想想也是，做人不要太怂。 Q：乐队的少年少女们是怎么聚集到一起的？A：我和江頔大半年前开始一起玩。然后徐艺和高欣的入职信里面分别提到过自己有古筝和钢琴的背景，基本我都是第一时间发信过去邀请的。有一次排练路上遇到王维，王维给我展示了他手上的茧和摁弦留下的压痕把我惊着了，就顺理成章的拉他过来一起玩了。 Q：大家为了年会准备了多久？都怎么排练的？ A：大概一个半月前就知道有年会任务，但我刚好要出差，出差回来以后进入考试季，徐艺基本人间蒸发，高欣家里也有不少事情，所以排练基本停滞，新年了还没定歌，1月10号之前就没有一次排练能来超过三个人……好在徐艺考完试以后大家突然士气大涨团结了起来，很密锣紧鼓地排了好几个晚上。 按道理排练都是合练，大家把各自的部分练好，然后聚到一起合一下。可惜很多时候回家也没法练，只好占用合练的时间熟悉乐段。年会前的周日，江頔和王维突发奇想想来段Metallica的opening，他们俩就坐那里慢慢练。徐艺开始调古筝，王维抠了个简谱让她练西湖的前奏。我和Cynthia在抠21 guns bridge后面的一段钢琴的solo。临急抱佛脚，也胜于不抱。 Q：日常排练有影响到工作吗？A：周日练完我就病倒了，周一来了以后请了一天半的病假。加上年会休了一天，等于我这周只上了两天班……（Shen哥饶命） Q：怎么选的这两首歌？好像不太主流？A：《西湖》是江頔心头好，电吉他solo部分是这首歌曲里面相当出彩的部分，大家都很喜欢。另外曲子也有很明显的民族特色，徐艺也能无缝地把他们加进来，所以就选了。《21 guns》是我前年年会就想唱的，旋律和内在的精神都很美。（其实最主要还是因为简单好排） Q：你们每个人的主要职能是什么？opening，西湖，21 guns不同歌之间走位花枝招展的……A：高冷的解释是人少就只能任性了，其实心里想的是这么玩还显得逼格很高的样子。吉他比较稳定，江頔主音王维节奏，剩下的人就各种打杂。这次主要是选曲玩脱了。opening不需要键盘，高欣觉得无聊就背了把贝斯和一和；西湖江頔唱，需要徐艺弹古筝，没人打鼓就只能我顶，所以贝斯又没有了。到21 guns了除了我没人能记得住词，所以我就去唱了，徐艺又回来打鼓。 Q：那究竟每个人技能点都加到哪了？A：王维大二就把吉他点开了，但最近才开始接触电琴。Cynthia是初中就钢琴十级的美萝莉。江頔的技能点一半加在吉他上，一半加在点烟上。徐艺我感觉除了古筝还有些钢琴的黑暗历史，鼓是来公司了以后学的。我的技能点主要加在《劲乐团》和《节奏大师》这类的音乐游戏上。 Q：这次听到的版本好像和原曲都有不一样的地方？都做了哪些变化？A：Opening我没时间去研究鼓点，所以是乱打的，等江頔王维补充吧。西湖主要是加了徐艺的古筝前奏。21 guns的钢琴solo参考了green day在慕尼黑live的版本改了一下。We will rock you里面那段rap是拿的five和Queen合演时的一段，然后我把词里的Queen全部改成Boss了，刚好和老板们上台打鼓交相辉映。 Q：互相选一个你最想吐槽的点吧？文中：徐艺说她打鼓不数拍子王维：徐艺说她打鼓不数拍子江頔：徐艺说她打鼓不数拍子高欣：徐艺说她打鼓不数拍子徐艺：…… Q：有没有什么遗憾的部分？文中：太TM的多了。最惨的是难得人齐一次没拍台上的合照……第二惨的是对麦的数量估计不足。当晚现场的麦不够，这个影响略大。本来我是要在西湖里给江頔伴唱的，但是鼓位没法再立一支麦了，所以主歌的回声效果没法出来，副歌部分人声也稍微有些干。21 guns徐艺本来也要在鼓位solo段献声的，但是整个腰带和耳麦实在对不起她当天的造型，所以又没唱。少了些唯美的感觉吧。咳咳，最后终于要讲了……现场返送稍微有些问题，最后we will rock you的时候由我成功带领车祸，连累大家了。突然发现居然台下合照也只有手机拍的…… Q：你真的觉得你21 Guns 唱得比Bille好吗？A：下场看了一遍视频我就再也没有这样认为了。 Q：民工们给自己的首演打多少分？文中：我觉得王维是最稳的，85。其他人略有瑕疵，75吧。我对车祸付主要责任，也就是个在不及格线徘徊的分数。其实后来下场以后大家很沮丧，都说自己哪里哪里弹错了太丢人了……王维：大家都是72，3分吧，毕竟第一次演，很多地方需要磨合。江頔：50分，演是演下来了，效果就不要提了。徐艺：1分，居然忘记了主持人出场。高欣：（沉默是金）（喂喂你们都这么严格干嘛） Q：这次收了多少出场费？A：导演组给了钱我们买服装，我们印了三张海报后，剩下就只够换点弦啥的了，想想还是吃了划算。 Q：说起海报，做得有点……弱啊?A：我们本来是有个UED同学的，但是这位同学实在太忙所以这个活只能又落到打杂狂魔我的头上了，最后的出品当然也完美的展现出羸弱的PS水平。但事实上大部分时间都不是用在P图上……我元旦去丈母娘家的第一个晚上在下photoshop，第二个晚上还在催大家给我发照片，临打印前10分钟有人说要换照片……真的你们也是有够残暴的。 Q：后面还有什么计划不？A：有机会的话我们可能做一些原创曲子或者试一些新的风格，MCR和二手玫瑰是我特别想玩的。 不过大家品味迥异，定歌本身就是非常困难的事情啦。 Q：好的，最后有什么话要说的吗？A：转自官方版回顾—— Awesome breakthrough! What I really feel great is that we got a totally fresh experiences when trying some new instruments other than our familiar ones. Most of our band members played multiple roles/gears in different songs during the show, that’s amazing. I have imagined that before but still feel excited when it finally come true.To Di, Wei, Xin and Yi: it’s a beautiful journey to rock with you boys and girls. I will remember all the brilliant notes we played and forget those awkward ones. Of course I will be much happier if you guys could promise me that next time we could start to rehearse a little bit earilier than 5 days before the show.To all those Beijing Yahoos who tolerated our rehearsal noises: thank you for not cursing us, and I hope you enjoy the show. Music brought joys and powers to us so we could keep smiling when facing our lives. Happy new year!And finally, yes, I did think I sing better than Billie, until I watch the recap. LOL 民间版：谢谢，希望我们还有机会在有耐心看到这里的朋友面前演出吧。","categories":[{"name":"Music","slug":"Music","permalink":"http://musicdiary.me/categories/Music/"},{"name":"Band","slug":"Music/Band","permalink":"http://musicdiary.me/categories/Music/Band/"}],"tags":[{"name":"Music","slug":"Music","permalink":"http://musicdiary.me/tags/Music/"}]},{"title":"Music Production Learning Notes","slug":"Music-Production-Learning-Notes","date":"2014-07-22T11:18:54.000Z","updated":"2018-09-02T07:35:40.000Z","comments":true,"path":"2014/07/22/Music-Production-Learning-Notes/","link":"","permalink":"http://musicdiary.me/2014/07/22/Music-Production-Learning-Notes/","excerpt":"This is a very very long article on Logic Pro learning, based on The “Music Production” course on Coursera. Six sections will be included as listed: Connector and Cables Basic Editing in Logic Pro X Automation in Logic Pro X Dynamic Processors Configurating EQ Understanding Synthesizer Chapter 1: Connector and CablesBe aware of the importance about cables and connectors because quality of cables could prevent us from getting noisy voice. many sound malfunction are caused by broken connectors or cables.","text":"This is a very very long article on Logic Pro learning, based on The “Music Production” course on Coursera. Six sections will be included as listed: Connector and Cables Basic Editing in Logic Pro X Automation in Logic Pro X Dynamic Processors Configurating EQ Understanding Synthesizer Chapter 1: Connector and CablesBe aware of the importance about cables and connectors because quality of cables could prevent us from getting noisy voice. many sound malfunction are caused by broken connectors or cables. TS cableIt’s also known as “instrument cable”. But what’s TS? The connector of the TS cable is cylindrical in shape, typically with two, three or four contacts. Three-contact versions are known as TRS connectors, where T stands for “tip”, R stands for “ring” and S stands for “sleeve”. Similarly, two and four-contact versions are called TS and TRRS connectors respectively. The connector was invented for use in telephone switchboards in the 19th century and is still widely used. In its original configuration, the outside diameter of the “sleeve” conductor is 1⁄4 inch (exactly 6.35 mm). The “mini” connector has a diameter of 3.5 mm (approx. 1⁄8 inch) and the “sub-mini” connector has a diameter of 2.5 mm (approx. 3⁄32 inch). Common usage example: connect gears to amplifier or DI. XLR cableXLR cable is a standard Microphone cables. And it’s also a balanced cable. The XLR connector is a style of electrical connector, primarily found on professional audio, video, and stage lighting equipment. The connectors are circular in design and have between 3 and 7 pins. They are most commonly associated with balanced audio interconnection. The following tables show usage of each pin. Pin Function 1 Chassis ground (cable shield) 2 Positive polarity terminal for balanced audio circuits (aka “hot”) 3 Negative polarity terminal for balanced circuits (aka “cold”) RCA cable RCA cable is initially designed for composite video (yellow) and stereo audio (white and red). In music production, they are mainly used to connect consumer grade appliances. The name “RCA” derives from the Radio Corporation of America, which introduced the design by the early 1940s for internal connection of the pickup to the chassis in home radio-phonograph consoles. Balanced / Unbalanced cableWe talk about balance and unbalance in above sections. In telecommunications and professional audio, a balanced line or balanced signal pair is a transmission line consisting of two conductors of the same type, each of which have equal impedances along their lengths and equal impedances to ground and to other circuits. The chief advantage of the balanced line format is good rejection of external noise when fed to a differential amplifier. Chapter 1: ReflectionWe talk about TS cable, which connect gears to amplifier or DI; XLR cable, which mainly connect microphone; RCA cables, which connect consumer grade appliance. And we also talk about balanced cable and it’s advantage of rejecting noices. It’s interesting to know more detail about cables, since our instructor Prof. Loudon emphasise connector and cables are important and I also have similar experiences when playing with my gears. Beside reviewing some knowledge in class material, I also find something interesting stuffs such as pin function. Finally, thank you for reading this post and I will be really appreciate if you could post your feedback and help me improve! ReferencesBalanced cable http://en.wikipedia.org/wiki/BalancedXLR connector http://en.wikipedia.org/wiki/Xlr_cableRCA cables http://en.wikipedia.org/wiki/Rca_cable Chapter 2: Basic Editing in Logic Pro XThis section will cover how to perform important editing tasks in your DAW including: trim, separate, crossfade, merge, grid, cycle, markers, zoom, name and color. My DAW is Logic Pro X. Maybe you are using a different DAW, but I believe operation would be similar (or, to some extent) for other DAW. Before starting this lesson, I would like to express my favour to using shortcut keys. They could greatly improve efficiency. And I wish you could feel its power during this lesson. TrimmingThere’s no Trim shortcut keys. Here is how we do a basic triming by mouse. Select a single region Move the mouse to the edge of the region Drag mouse to trim Note if you are going to the up-right corner of the last region of a track, you will create a loop of this region Separate (Split)In Logic Pro, “Separate” is called “Split”. Here is how we do a basic spliting. Select a single region move the playhead to the place we like to split split region by ⌘T CrossfadeThis is going to show how to create crossfade for 2 adjacent blocks. Show the “Edit” View by E Select the “Fade tool” (only available by mouse) in the “left click tool” Drag an region between the two tracks to create crossfade Manipulate the crossfade curves to get preferable effects MergeIn Logic Pro, one kind of “Merge” are called “Convert to File” Select multiple regions by pressing ⇧(Shift) convert selected region by ⌥⌘F Grid Show/Hide Grid lines by ⌃G Slightly move region by dragging region with mouse and holding ⌃ CycleHere’s how we do to repeatly playing a region. Press C to switch “Cycle” Mode Then goto the top of the track, create a cycle region (yellow region in the screenshot) by dragging mouse Cycle region is also control by Grid, so we could pressing ⌃ to adjust cycle region length. Then we could place the playhead to in the middle of the region and hit space to play this region repeatly and to optimize it. ZoomThere is 2 types of Zoom in Logic Pro – Horizontal and Vertical. Here’s the basic zooming techniques. As our instrutor said, select the track before zooming Horizonal Zoom in / out by ⌘ ← / → Vertical Zoom in / out by ⌘ ↑ / ↓ After zooming, the playhead will remain the same position on the screen if possible. Name and ColorNaming / coloring a track is good habit. Especially if a pattern is formed, good naming could help you better manage the music project, and coloring could help you identify tracks visually. Name the track by double click the track name Color the track by goto the track number, popup menu by right click, then click “Assgin Track Color” Name / Color Region by track by ⇧⌥N / ⇧⌥C Show / Hide color palette by ⌥ C Other tips Navigating by keyboard will also greatly improve efficiency. use /{number} to navigate to No.{number} bar Hit Space to start or pause playing Final weapon for key command: Logic Pro X key commands. I highly encourage people go there and search any term they are interested in. There is always surprice to encounter useful features. Chapter 2 ReflectionWe introduced some important editing approach in this lesson, most of them could be handled by using keyboard shortcut. Maybe occupational disease for a programmer, I really feel keyboard is my best friend :). Wish this help. Finally, thank you for reading this post and I will be really appreciate if you could post your feedback and help me improve! Chapter 3: Automation in Logic Pro XRecording automation First, select a track for adding automation. (In our case, track LEAD VOX_02) Press A to enable automation view. we can see the automation icon become yellow. Then select type of automation, (In our case, Volume,) And add control point by double click Editing automation We can also add other type of automation (such as Pan) and all automation in a track will be applied to the track. Double click to add/remove automation control point We could use pencil tools to draw the automation by hand We could also use erase tools to remove a series of control points. Finally, if we turn on the automation display, we could visualize all automation effects on the original tracks. In the screenshot, I set it to Volume, but you could still see the green pan automation line (Notice the background of the original track). Chapter 3 ReflectionThe ability of changing plugin parameters over time make automation a must have skill in musical production. Chapter 4: Dynamic Processor In the following lesson, I will describe the concept behind dynamic processors and look at the four basic parameter settings related to them. Dynamic ProcessorsDynamic Processors are post-production effects designed to manipulate the dynamic range of a piece of audio. That is, they affect how many decibels there are between the quietest and loudest levels of the output. Dynamic Processors can either: reduce dynamic range through COMPRESSION, or increase dynamic range through EXPANSION Compression and ExpansionTo compress (reduce) the dynamic range of a piece of audio, you can either increase the levels of the quiet parts to make them louder or decrease the levels of the loud parts to make them quieter.Compressors and limiters fall under this category. While either method can effectively decrease the dynamic range, a compressor or limiter usually brings down the levels above a certain threshold rather than brings up the levels of the quiet parts. This is called DOWNWARD COMPRESSION and is usually what people are referring to when they talk about “compressors.” To expand the dynamic range of a piece of audio, you can either decrease the levels of the quiet parts to make them quieter or increase the levels of the loud parts to make them louder.Expanders and noise gates fall under this category. Expanders and noise gates usually used to decrease quiet levels. In the case of gates, quiet levels (those that fall below the threshold) are in effect reduced to signal off. Parameters of Dynamic ProcessorThresholdThreshold refers to the level where the dynamic processor starts to function. If audio crosses over this dB value, the other parameters kick into effect. Above this dB value in a compressor/limiter, the sound is processed (below it, the signal passes through unchanged.)Below this dB value in an expander/noise gate the sound is processed (above it, the sound passes through unchanged.)In other words, a compressor/limiter lowers the volume of a signal when it gets too loud, and an expander/gate lowers the volume of a signal when it gets too quiet. RatioRatio refers to how much the level is affected once it has crossed the threshold, expressed as INPUT:OUTPUT. The higher the ratio, the more extreme the dynamic processing. 1:1 — for a signal level 1 dB past the threshold, 1dB will be outputted. In other words, nothing changes.4:1 — for a signal level 4 dB past the threshold, 1dB will be outputted. The output will be one quarter of what goes in. In the case of a compressor, this ratio is considered to be heavy compression.10:1 — for a signal level 10 dB past the threshold, 1dB will be outputted. In the case of expansion, this ratio or higher is considered to be a noise gate. In the case of compression, this ratio or higher is considered to be a limiter.30:1 — for a signal level 30 dB past the threshold, 1dB will be outputted. This essentially stops the sound. In the case of compression, this ratio along with low attack and release times is considered to be a BRICK WALL LIMITER. AttackAttack refers to how quickly the volume fader kicks in once the signal has crossed the threshold. This is expressed in milliseconds. The lower the rate, the faster the fader will move.The attack rate controls how much of the transient will be allowed through unaffected by the processor. The transient is the part of a sound where the amplitude changes a lot in a small amount of time, for example at the head of a drum hit. ReleaseRelease refers to how quickly the volume fader returns to normal once the signal has crossed back from the threshold. This is expressed in milliseconds [ms]. The lower the rate, the faster the fader will move. The ATTACK and RELEASE values are set according to the type of sound and the desired impact. If the source swells in, a longer attack and release could be a good choice. If it the sound itself is “punchy”, a low attack and release could work well. A shorter attack also gives the sound punchiness, whereas a longer attack softens the sound. In compression a fast attack can stop the transient coming through, but it can also soften the character of the sound somewhat. A longer attack time allows more of the transient through but means there could be a larger volume peak. On the other hand, a noise gate is usually set with a low attack so that the transient comes through, otherwise the sound would swell in.If the release time is too long, it can result in a “pumping” sound because the processor hasn’t released before the next input comes in. Chapter 4 ReflectionThe ability of dynamic range make it a very powerful tools because it could help removing unwanted signal which is inevitable during recording, or make the signal flow more stable. Thank you for reading this post and I will be really appreciate if you could post your feedback and help me improve! Chapter 5: Configurating EQ In this lesson, I am going to demonstrate tunning the EQ of bass track. Let’s get started! Panel IntroductionFirst of all, select the bass track and activate channel EQ panel by clicking the “Channel EQ” button in the bass track channel. In the panel, we can see: Top section name of current settings compare button (switch to show pre EQ and post EQ effects settings) Main section on the left panel, master gain level on the right panel, there is EQ control switch at different frequency ranges. By default, the lowest and highest end are disabled. Right down the control switch is the EQ preview area. we could also drag the control point in the curve to set parameters. below the preview area, it’s the configuration panel where we accurately set the EQ parameters. Configuring the Bass trackHere’s what I going to configurate the EQ of Bass: Filter signals under 100 Hz &amp; start reduce signals over 520 Hz to put more focus on the bass range increase 6dB around 260 Hz (to make sound solid) increate 3dB around 730 Hz (to increase noise in strum) And here’s the final EQ effect after some other minor tunning by comparing the pre EQ and post EQ. and you could also see the actual EQ curve thumbnail at the bass track channels on the left. Save as a pre-setIf this setting could be a general one, then we could click the name of setting to save these settings as “bass track EQ”, for example. Or save it as a new default settings, so it could be reused next time Chapter 5 ReflectionIn this lesson we have examined configurating the EQ of a track. It’s very helpful in music production. And it need 2 factors to make this configuration a good one in my opinion: Knowing the gear/instrument well. Understanding its basic working range is very helpful on the setting the outline configurations. Listen carefully with your ear and trust your instinct in minor configurations. Chapter 6: Understanding SynthesizerThis note is for week 6 of Introduction To Music Production at Coursera.org. I will be teaching “Explain the usage of 5 most important synthesis module: Oscillator, Filter, Amplifier, Envelope and LFO”. A sound synthesizer (often abbreviated as “synthesizer” or “synth”) is an electronic musical instrument that generates electric signals which can be converted to sound through loudspeakers or headphones. Synthesizers may either imitate other instruments or generate new timbres. They can be played (controlled) via a variety of different input devices, including keyboards, music sequencers and instrument controllers. And here we will cover modules in a synthesizer. Definitions: Oscillator: A device capable of generating a periodic signal or waveform. Filter: A device capable of attenuating a signal at a set cutoff frequency. Amplifier: A device capable of boosting a signal amplitude. Envelope: The pattern generated from the attack, sustain, decay and release of a sound. Low Frequency Oscillator (LFO): A secondary oscillator device designed to produce signals whose frequency is at the bottom of, or below, the audio range. The Oscillator generates a basic wave (or tone) that is used throughout the synthesis process. Oscillators generate various waveforms: sine, triangle, square, and sawtooth. The sine wave is basically a waveform that is fundamental and has no overtones or partials. The square, triangle, and sawtooth waveforms are capable of producing rich harmonics (partials) to influence the timbre of sound. The oscillator function is to generate a sound for all the other modules in the synthesizer. After the Oscillator generates the signal it is passed to a filter to remove unwanted partials within a frequency spectrum. This process is called subtractive synthesis because the filter removes unwanted partials. Filters are classified as low pass, high pass and band pass filters. The filter will start functioning when the signal reaches the cutoff frequency. After filtering, the signal is passed to an amplifier. The amplifier function is to adjust the level or amplitude of thesignal. It also functions as a way to pan the signal from left to right. The envelope in conjunction with modulation is used to generate a pattern by manipulating the attack, sustain, decay and release of a sound. LFOs are used to control different parameters or characteristics of a sound in the filter and or amplifier, such as pitch, which many musicians use to explore incredible creativity. Chapter 6 ReflectionSynthesis is a tool to boost our imagination and creativity when composing electronical music. We talk about the basic of syn but we should be awared that there are different types of systhesis for different instrument and timbre waiting for us to explore. I would suggest ES2 to start with and then select a syn that match one’s need to dive in. For example, UltraBeat for a drummer. I hope you find this post helpful for review purpose. Thank you for reading this post and I will be really appreciate if you could post your feedback and help me improve.","categories":[{"name":"Music","slug":"Music","permalink":"http://musicdiary.me/categories/Music/"},{"name":"Music Production","slug":"Music/Music-Production","permalink":"http://musicdiary.me/categories/Music/Music-Production/"}],"tags":[{"name":"Music Production","slug":"Music-Production","permalink":"http://musicdiary.me/tags/Music-Production/"},{"name":"Coursera","slug":"Coursera","permalink":"http://musicdiary.me/tags/Coursera/"},{"name":"Logic Pro","slug":"Logic-Pro","permalink":"http://musicdiary.me/tags/Logic-Pro/"}]}]}